src/Catalogs/ВнешниеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВнешниеОбработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьДоОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбластьДействияОбработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяМетаданных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОтчет</Name>
					<Comment>Внешний отчет</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеОбработки/Forms/ФормаСписка/module.bsl
////////////////////////////////////////////////////////////////////////////////
//ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии()
	
	Если Не ЗначениеЗаполнено(ВидОбработки) Тогда
		ВидОбработки = Перечисления.ВидыОбработок.ПечатнаяФорма;
	КонецЕсли;
	
	СправочникСписок.Отбор.ВидОбработки.Установить(ВидОбработки);
	ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидОбработки.Доступность = Ложь;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Обработчик события "ПриИзменении" поля ВидОбработки.
//
Процедура ВидОбработкиПриИзменении(Элемент)
	
	СправочникСписок.Отбор.ВидОбработки.Значение = ВидОбработки;	
	
КонецПроцедуры

// Обработчик события "Очистка" поля "ВидОбработки".
//
Процедура ВидОбработкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Обработчик события "ПередНачаломДобавления" списка справочника.
//
Процедура СправочникСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа)
	
	Если Не ЭтоГруппа Тогда 
		Отказ = Истина;
		
		НовыйЭлемент = Справочники.ВнешниеОбработки.СоздатьЭлемент();
		НовыйЭлемент.ВидОбработки = ВидОбработки;
		НовыйЭлемент.ПолучитьФорму("ФормаЭлемента").Открыть();
	КонецЕсли;
КонецПроцедуры

// Обработчик события "НачалоВыбора" поля ВидОбработки.
//
Процедура ВидОбработкиНачалоВыбора(Элемент, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//СписокЗначений = Новый СписокЗначений;
	//СписокЗначений.Добавить(Перечисления.ВидыОбработок.ПечатнаяФорма);
	//
	//ЗначениеВыбора = ВыбратьИзМеню(СписокЗначений, Элемент);
	//
	//Если ЗначениеВыбора <> Неопределено Тогда
	//	Элемент.Значение = ЗначениеВыбора.Значение;
	//КонецЕсли;
КонецПроцедуры
